---
kind: type
id: T:Autodesk.Revit.Exceptions.OperationCanceledException
source: html/aea34480-ceb5-b49f-129d-0799e7bb1c21.htm
---
# Autodesk.Revit.Exceptions.OperationCanceledException

The exception that is thrown when an operation is unexpectedly cancelled.

## Syntax (C#)
```csharp
[SerializableAttribute]
public class OperationCanceledException : ApplicationException
```